-- 1
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_СЕССИЯ.ЧЛВК_ИД
FROM Н_ЛЮДИ
LEFT JOIN Н_СЕССИЯ ON ЧЛВК_ИД=Н_ЛЮДИ.ИД
WHERE Н_ЛЮДИ.ИМЯ > 'Владимир' AND
Н_СЕССИЯ.ИД > 14369 AND
Н_СЕССИЯ.ИД = 32199;

-- 2
SELECT
   Н_ЛЮДИ.ИМЯ,
   Н_ВЕДОМОСТИ.ЧЛВК_ИД,
   Н_СЕССИЯ.ИД
FROM Н_ЛЮДИ
RIGHT JOIN Н_ВЕДОМОСТИ
   ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
   AND Н_ЛЮДИ.ФАМИЛИЯ = 'Иванов'
RIGHT JOIN Н_СЕССИЯ
   ON Н_ВЕДОМОСТИ.СЭС_ИД = Н_СЕССИЯ.ИД
WHERE Н_ВЕДОМОСТИ.ИД = 1250972;

-- 3
SELECT COUNT(*)
FROM "Н_ЛЮДИ"
INNER JOIN "Н_УЧЕНИКИ"
ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
AND "Н_УЧЕНИКИ"."ГРУППА"='3102'
WHERE (CURRENT_DATE - "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ") < make_interval(20, 0, 0, 0, 0, 0, 0);

-- 4
SELECT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД", "Н_ПЛАНЫ"."НОМЕР",  count("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА")
FROM "Н_ГРУППЫ_ПЛАНОВ"
JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД"="Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД", "Н_ПЛАНЫ"."НОМЕР"
HAVING count("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА") < 2;

-- 5. Было решено использовать округление, поскольку, в результате была только группа 3100
WITH min_3100 AS (
   SELECT AVG(EXTRACT(YEAR FROM AGE(CURRENT_DATE, l."ДАТА_РОЖДЕНИЯ"))) AS min_avg_age
   FROM "Н_УЧЕНИКИ" u
   INNER JOIN "Н_ЛЮДИ" l ON u."ЧЛВК_ИД" = l."ИД"
   WHERE u."ГРУППА" = '3100'
)
SELECT "Н_УЧЕНИКИ"."ГРУППА", AVG(EXTRACT(YEAR FROM AGE(CURRENT_DATE, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) AS avg_age
FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
CROSS JOIN min_3100
GROUP BY "Н_УЧЕНИКИ"."ГРУППА", min_3100.min_avg_age
HAVING ROUND(AVG(EXTRACT(YEAR FROM AGE(CURRENT_DATE, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))))=ROUND(min_3100.min_avg_age);



-- 6
SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_УЧЕНИКИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ЛЮДИ"
ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND "Н_УЧЕНИКИ"."ПРИЗНАК"='отчисл'
INNER JOIN "Н_ГРУППЫ_ПЛАНОВ" ON "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА" = "Н_УЧЕНИКИ"."ГРУППА"
JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД"="Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
JOIN "Н_НАПР_СПЕЦ" ON "Н_НАПР_СПЕЦ"."ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД"
WHERE "Н_УЧЕНИКИ"."КОНЕЦ" < make_timestamp(2012, 9, 1, 0, 0, 0)
AND "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101';

-- 7
SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", MIN("Н_УЧЕНИКИ"."ИД") AS ИД, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"
FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" IN (
   SELECT "ФАМИЛИЯ"
   FROM "Н_ЛЮДИ"
   GROUP BY "ФАМИЛИЯ"
   HAVING COUNT(DISTINCT "ДАТА_РОЖДЕНИЯ") > 1
)
GROUP BY "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"
ORDER BY "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ";
